//CBLTBLJ JOB 1,NOTIFY=Z26069,MSGCLASS=X,MSGLEVEL=(1,1)
//JOBLIB   DD  DSN=Z26069.LOAD,DISP=SHR
//*
//PPLATE  EXEC PGM=CBLTBL
//STEPLIB   DD DSN=Z26069.LOAD,DISP=SHR
//INFL     DD DSN=Z26069.WORDS.ENTRY,DISP=SHR
//PRTLINE   DD SYSOUT=X
//SYSOUT    DD SYSOUT=X
//SYSPRINT  DD SYSOUT=X
//CEEDUMP   DD DUMMY
//SYSDUMP   DD DUMMY
//